In [1]:
from Repositories.AdventureWorksRepository import Repository

In [2]:
adventureWorksConnectionString = "Driver={SQL Server};Server=DESKTOP-8INVJ1O\SQLEXPRESS;Database=AdventureWorks;trusted_connection=yes"
adventureWorkRepository = Repository(adventureWorksConnectionString)

# Product

In [3]:
productDataFrame = adventureWorkRepository.getProductDataFrame()
productDataFrame

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AdventureWorksRepository.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  productData = pd.read_sql(productJoinQuery, self.dbConnection)

,PRODUCT_id,PRODUCT_name,PRODUCT_category,PRODUCT_sub_category,PRODUCT_colour,PRODUCT_prod_cost
0,680,"HL Road Frame - Black, 58",Components,Road Frames,Black,1059.3100
1,706,"HL Road Frame - Red, 58",Components,Road Frames,Red,1059.3100
2,707,"Sport-100 Helmet, Red",Accessories,Helmets,Red,13.0863
3,708,"Sport-100 Helmet, Black",Accessories,Helmets,Black,13.0863
4,709,"Mountain Bike Socks, M",Clothing,Socks,White,3.3963
...,...,...,...,...,...,...
290,995,ML Bottom Bracket,Components,Bottom Brackets,None,44.9506
291,996,HL Bottom Bracket,Components,Bottom Brackets,None,53.9416
292,997,"Road-750 Black, 44",Bikes,Road Bikes,Black,343.6496
293,998,"Road-750 Black, 48",Bikes,Road Bikes,Black,343.6496
294,999,"Road-750 Black, 52",Bikes,Road Bikes,Black,343.6496

# Customer

In [4]:
customerDataFrame = adventureWorkRepository.getCustomerDataFrame()
customerDataFrame

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AdventureWorksRepository.py:40: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customerData = pd.read_sql(customerJoinQuery, self.dbConnection)

Empty DataFrame
Columns: [CUSTOMER_id, CUSTOMER_address, CUSTOMER_city, CUSTOMER_state, CUSTOMER_country, CUSTOMER_company_name]
Index: []

# Employee

In [5]:
employeeDataFrame = adventureWorkRepository.getEmployeeDataFrame()
employeeDataFrame

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AdventureWorksRepository.py:61: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employeeData = pd.read_sql(employeeJoinQuery, self.dbConnection)

,EMPLOYEE_id,EMPLOYEE_first_name,EMPLOYEE_last_name,EMPLOYEE_city,EMPLOYEE_state,EMPLOYEE_country
0,285,Syed,Abbas,Bothell,Washington,United States
1,283,David,Campbell,Bellevue,Washington,United States
2,278,Garrett,Vargas,Calgary,Alberta,Canada
3,279,Tsvi,Reiter,Memphis,Tennessee,United States
4,277,Jillian,Carson,Duluth,Minnesota,United States
5,275,Michael,Blythe,Detroit,Michigan,United States
6,288,Rachel,Valdez,Berlin,Hamburg,Germany
7,287,Amy,Alberts,Renton,Washington,United States
8,276,Linda,Mitchell,Nevada,Utah,United States
9,282,José,Saraiva,Ottawa,Ontario,Canada
10,289,Jae,Pak,Cambridge,England,United Kingdom
11,290,Ranjit,Varkey Chudukatil,Bordeaux,Gironde,France
12,274,Stephen,Jiang,Redmond,Washington,United States
13,286,Lynn,Tsoflias,Melbourne,Victoria,Australia
14,280,Pamela,Ansman-Wolfe,Portland,Oregon,United States
15,284,Tete,Mensa-Annan,Cambridge,Massachusetts,United States
16,281,Shu,Ito,San Francisco,California,United States

# Day

In [6]:
DAY_date = adventureWorkRepository.getDayDataFrame()
DAY_date

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AdventureWorksRepository.py:76: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  orderDates = pd.read_sql("SELECT DISTINCT OrderDate FROM sales.SalesOrderHeader", self.dbConnection)

       DAY_date DAY_MONTH_nr DAY_QUARTER_nr DAY_YEAR_nr
0    2011-06-27            6              2        2011
1    2011-09-06            9              3        2011
2    2012-05-24            5              2        2012
3    2012-08-03            8              3        2012
4    2013-04-21            4              2        2013
...         ...          ...            ...         ...
1119 2014-06-18            6              2        2014
1120 2012-06-09            6              2        2012
1121 2012-07-28            7              3        2012
1122 2013-12-02           12              4        2013
1123 2014-01-20            1              1        2014

[1124 rows x 4 columns]

# Order Details

In [7]:
orderDetailsData = adventureWorkRepository.getOrderDetailsDataFrame()
orderDetailsData

C:\Users\Max\Documents\GitHub\Scripts\DataHandling\Merging\Repositories\AdventureWorksRepository.py:91: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  orderDetailsData = pd.read_sql(orderDetailsQuery, self.dbConnection)

,ORDER_DETAIL_NUMBER,ORDER_DETAIL_order_quantity,ORDER_DETAIL_unit_price,DAY_date,EMPLOYEE_id,CUSTOMER_id,PRODUCT_id
0,1,1,2024.994,2011-05-31,279.0,29825,776
1,2,3,2024.994,2011-05-31,279.0,29825,777
2,3,1,2024.994,2011-05-31,279.0,29825,778
3,4,1,2039.994,2011-05-31,279.0,29825,771
4,5,1,2039.994,2011-05-31,279.0,29825,772
...,...,...,...,...,...,...,...
121312,121313,1,21.980,2014-06-30,NaN,15868,878
121313,121314,1,8.990,2014-06-30,NaN,15868,712
121314,121315,1,21.980,2014-06-30,NaN,18759,878
121315,121316,1,159.000,2014-06-30,NaN,18759,879
121316,121317,1,8.990,2014-06-30,NaN,18759,712